#include <iostream>

using namespace std;

void num_sum_min_distance_eff_2318_2();
{
    /**
÷» Ћ»„≈— »… Ѕ”‘≈–
1. считываютс€ числа в черв€ка
2. выводитс€ кажда€ верси€ черв€ка как циклического буфера (после каждого шага/продвижени€ на одно число)
3. дл€ каждого шага черв€ка выводитс€ его содержимое и минимальное пройденное число
4. дл€ каждого шага черв€ка выводитс€ пара из числа в зубах и минимального пройденного
5. ищетс€ минимум среди сгенерированных пар, удовлетвор€ющих условию номер 2 (кратно ли числу)

    **/
}
int main()
{
    num_sum_min_distance_eff_2318_2();
    return 0;
}
