#include <iostream>
#include <vector>
using namespace std;

void  min_sum_distance()
{
    /**
    Для проверки того, что сообщение передано без помех, используется примитивный алгоритм подсчёта контрольной суммы -
     находится наименьшая сумма двух различных (стоящих на разных местах в сообщении, но может быть и одинаковых по значению)
     чисел из сообщения, при этом числа должны находиться друг от друга на расстоянии не менее 4
    (то есть между ними должно стоять минимум 3 других числа). Реализуйте вычисление контрольной суммы.



    + 1) считать числа
    + 2) вывести пары
    + 3) вывести пары с минимальным расстоянием
    + 4) вместо вывода пары подсчитать сумму
    5) найти минимум среди сумм
    **/

    int n, sum_of_pairs = 0, min_sum = 2005;
    cin >> n;
    vector<int> numbers(n, 0);
    for (int i(0); i < n; i++)
        cin >> numbers[i];
    for (int j(0); j<n-1; j++)
        for (int i(j+1); i<n; i++)
            if (i - j > 3)
            {
                sum_of_pairs = numbers[j] + numbers[i];
                if (sum_of_pairs < min_sum)
                    min_sum = sum_of_pairs;
            }
    cout << min_sum;
}

int main()
{
    min_sum_distance();
    return 0;
}
